<?php
/**
 * @author linruirong@mingchao.com
 * @copyright www.mingchao.com
 */
$dictPetType = array(
	10051001 => '坏蛋'           ,
	10052001 => '小团子'         ,
	10051002 => '灵灵猫'         ,
	10052002 => '5级宠物'        ,
	10052003 => '小灰兔'         ,
	10251001 => '猴子'           ,
	10252001 => '相思鸟'         ,
	10251002 => '25级宠物'       ,
	10252002 => '玉兔'           ,
	10501001 => '三尾狐'         ,
	10502001 => '蝴蝶'           ,
	10502002 => '白猿'           ,
	10501002 => '熊猫'           ,
	10851001 => '朱雀'           ,
	10852001 => '玄武'           ,
	10851002 => '灰熊'           ,
	10852002 => '凤凰'           ,
	11051001 => '青龙'           ,
	11052001 => '白虎'           ,
	20051001 => '二代坏蛋'       ,
	20052001 => '二代小团子'     ,
	20051002 => '二代灵灵猫'     ,
	20052002 => '二代5级宠物'    ,
	20052003 => '二代小灰兔'     ,
	20251001 => '二代猴子'       ,
	20252001 => '二代相思鸟'     ,
	20251002 => '二代25级宠物'   ,
	20252002 => '二代玉兔'       ,
	20501001 => '二代三尾狐'     ,
	20502001 => '二代蝴蝶'       ,
	20502002 => '二代白猿'       ,
	20501002 => '二代熊猫'       ,
	20851001 => '二代朱雀'       ,
	20852001 => '二代玄武'       ,
	20851002 => '二代灰熊'       ,
	20852002 => '二代凤凰'       ,
	21051001 => '二代青龙'       ,
	21052001 => '二代白虎'       ,
);

// 宠物操作日志类型 t_log_pet_action.action
$dictPetAction = array(
	101 => '放生宠物',
	102 => '宠物洗灵',
	103 => '宠物提悟',
	104 => '宠物延寿',
	105 => '宠物学技能',
	106 => '宠物洗髓',
	107 => '宠物死亡',
);

//宠物获得类型(t_log_get_pet.get_way)
$dictPetGetWay = array(
	1=>'使用宠物召唤符获得',
);