<?php
$dictColor = array(1=>'白色',2=>'绿色',3=>'蓝色',4=>'紫色',5=>'橙色',6=>'金色',);
$dictQualityType = array(1=>'普通',2=>'精良',3=>'优质',4=>'无暇',5=>'完美');
$dictBagidName = array(0=>'在身上',1=>'主背包',2=>'扩展背包',3=>'扩展背包',4=>'扩展背包',5=>'天工炉',6=>'仓库1',7=>'仓库2',8=>'仓库3',9=>'仓库4'); //物品所在的位置
$dictFaction = array(1=>'云州',2=>'沧州',3=>'幽州');	
$dictPkMode = array(0=>'和平', 1=>'全体', 2=>'组队', 3=>'门派', 4=>'国家', 5=>'善恶');	
$dictWeaponType = array('无','刀','弓','扇','萧');//当前穿的武器的类型 0没有，1刀2弓3扇4萧
$dictOccupation = array(
	1=>'战士',
	2=>'射手',
	3=>'侠客',
	4=>'医仙'
	
);

$dictMissionType = array(1=>'主线任务',2=>'支线任务',3=>'循环任务');


$_BOSS_STATE = array(
	1=> '重生',
	2=> '死亡',
	3=>	'其他'
);



$dictYbcColor = array(
	1=>'白色',
	2=>'绿色',
	3=>'蓝色',
	4=>'紫色',
	5=>'橙色'
);

$dictYbcFinalState = array(
	//0=>'未发布状态',
	//1=>'拉镖状态',
	2=>'镖车被劫',
	3=>'超时完成',
	4=>'超时被删除',
	5=>'不在附近',
	6=>'成功拉镖',
	7=>'个人放弃',
	
	12=>'镖车被劫(国运)',
	13=>'超时完成(国运)',
	14=>'超时被删除(国运)',
	15=>'不在附近(国运)',
	16=>'成功拉镖(国运)',
	17=>'个人放弃(国运)',
	
	
);

$dictFamilyYbcType = array(

);


$dictFamilyYbcFinalState = array(
	1=>'断线离队',
	2=>'主动退出',
	3=>'被打爆',
	4=>'系统回收',
	5=>'被T',
	6=>'正常完成',
	7=>'超时完成',
);





//跟人镖车状态
//$dictYbcState  = array();
$dictYbcState = $dictYbcFinalState;
